Revit 2027 API
BuiltInFailures.StairRampFailures.NoCurvesInRailing Property
 Railing Sketch has no Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoCurvesInRailing { get; }
Public Shared ReadOnly Property NoCurvesInRailing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoCurvesInRailing {
	FailureDefinitionId^ get ();
}
static member NoCurvesInRailing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace